:PROPERTIES:
:ID:       BA461725-12D2-4F3D-883C-29FA4B3EA91E
:END:
#+title: LEDs
#+date: 2024-11-15 14:32 PM
#+updated:  2024-12-03 12:51 PM
#+filetags: :electronics:arduino:

* Resistors
Which resistor should I use? When in doubt use 220 ohm. Otherwise, these are
common resistor values:
| LED Color         | 3.3V    | 3.7V    | 5V      | 6V      | 9V      | 12V     |
|-------------------+---------+---------+---------+---------+---------+---------|
| AMBER 2.1V, 20mA  | 68 Ohm  | 82 Ohm  | 150 Ohm | 220 Ohm | 390 Ohm | 560 Ohm |
| BLUE 3.2V, 20mA   | 5.6 Ohm | 27 Ohm  | 100 Ohm | 150 Ohm | 330 Ohm | 470 Ohm |
| GREEN 2.1V, 20mA  | 68 Ohm  | 82 Ohm  | 150 Ohm | 220 Ohm | 390 Ohm | 560 Ohm |
| ORANGE 2V, 20mA   | 68 Ohm  | 100 Ohm | 180 Ohm | 220 Ohm | 390 Ohm | 560 Ohm |
| PINK 3.2V, 20mA   | 5.6 Ohm | 27 Ohm  | 100 Ohm | 150 Ohm | 330 Ohm | 470 Ohm |
| PURPLE 3.2V, 20mA | 5.6 Ohm | 27 Ohm  | 100 Ohm | 150 Ohm | 330 Ohm | 470 Ohm |
| RED 1.8V, 20mA    | 82 Ohm  | 100 Ohm | 180 Ohm | 220 Ohm | 390 Ohm | 560 Ohm |
| WHITE 3.2V, 20mA  | 5.6 Ohm | 27 Ohm  | 100 Ohm | 150 Ohm | 330 Ohm | 470 Ohm |
| YELLOW 2V, 20mA   | 68 Ohm  | 100 Ohm | 180 Ohm | 220 Ohm | 390 Ohm | 560 Ohm |

Ohms Law: v = ir

1 red LED on 5v circuit
#+begin_src ruby
r = (5.0 - 1.8) / 0.02
#+end_src

#+RESULTS:
: 160.0

3 blue LEDs in parallel on 5v circuit
#+begin_src ruby
r = (5.0 - 3.2) / (3 * 0.02)
#+end_src

#+RESULTS:
: 30.000000000000004
